E2EClient/xml_template/PRSBT/04_refill.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://webservice" xmlns:m1="java:xml_soapadapter">
  <soapenv:Body>
<refill>
      <RefillIN>
        <m1:EventSource></m1:EventSource>
        <m1:Channel>SW_CHANNEL_XXXX</m1:Channel>
        <m1:ScratchCardNumber />
        <m1:TransactionCode>SW_TRANSCODE_XXXX</m1:TransactionCode>
        <m1:Amount>SW_REFAMT_XXXX</m1:Amount>
        <m1:Currency>EUR</m1:Currency>
        <m1:RequestDate>SW_PVT_XXX</m1:RequestDate>
        <m1:PaymentMethod>SW_PAYMETHOD_XXXX</m1:PaymentMethod>
        <m1:BankAccountNumber />
        <m1:BankAccountType />
        <m1:BankBranch />
        <m1:BankName />
        <m1:PayerFirstName />
        <m1:PayerLastName />
        <m1:PayerPersonalID />
        <m1:CreditCardExpirationDate />
        <m1:CreditCardNumber />
        <m1:CreditCardType />
        <m1:ProductCatalogId></m1:ProductCatalogId>
        <m1:BillAccountCode>SW_ACCT_AUTO_XXXX</m1:BillAccountCode>
        <m1:RefilledObjectId></m1:RefilledObjectId>
      </RefillIN>
    </refill>
 </soapenv:Body>
</soapenv:Envelope>